#+BEGIN_HTML
---
layout: post
title: Python
tagline: " as a test driver"
permalink: /python/stdlib/unittest-niceties.html
categories: [python, stdlib, TDD, literate programming]
tags: [built-in functions, unittest]
---
#+END_HTML
#+STARTUP: showall
#+OPTIONS: tags:nil num:nil \n:nil @:t ::t |:t ^:{} _:{} *:t

#+TOC: headlines 3

* Preamble
  Nowadays =TDD= is a contemporary approach in software
  development serving as its catalyst, propeller and
  precise gauge in a single bottle. Lets take an attempt
  to unveil =unittest= core features.

* Documentation
  At the official [[https://docs.python.org/3/library/unittest.html][website]].

* Samples
  
** Simple test template
   #+BEGIN_SRC python
     import unittest

     def fun(x):
         return x + 1

     class SampleTest(unittest.TestCase):

         def test_equality(self):
             self.assertEqual(fun(3), 4)

         def test_inequality(self):
             self.assertNotEqual(fun(3), 5)

     unittest.main(SampleTest())
   #+END_SRC

   #+RESULTS:

** Fixture preparation

** Mock dissection

   #+BEGIN_SRC python :session mock
   from unittest.mock import Mock, call
   mock = Mock()
   mock.x
   #+END_SRC

   #+RESULTS:
   : <Mock name='mock.x' id='139992039642336'>

   #+BEGIN_SRC python :session mock :results output
   mock.x
   mock.x('Reassign a property', 11, 13)
   mock.x('Reassign a property', 11, 13)
   #+END_SRC

   #+RESULTS:
   : <Mock name='mock.x' id='139992039642336'>
   : <Mock name='mock.x()' id='139992039547120'>
   : <Mock name='mock.x()' id='139992039547120'>

   #+BEGIN_SRC python :session mock :results output
   mock.x('Attempt to reassign a property', 22, 31)
   # but
   mock.x('Complete reassigning is impossible', 22, 31)
   #+END_SRC

   #+RESULTS:
   : <Mock name='mock.x()' id='139992039547120'>
   : ... <Mock name='mock.x()' id='139992039547120'>

** Mock-up complex objects

* Conclusion
